# must
brew "neovim"
brew "zsh"

# language env
brew 'nodenv'
brew 'pyenv'
brew 'rbenv'

# tools
brew "bat"
brew "tokei"
brew "direnv"
brew "exa"
brew "fzf"
brew "ghr"
brew "git"
brew "git-lfs"
brew "github/gh/gh"
brew "htop"
brew "jq"
brew "ripgrep"
brew "wget"
brew "git-delta"
brew "fd"

# etc
brew "cmake"

# my tools
brew "k-nasa/tap/prf"
brew "k-nasa/tap/rgh"
tap "k-nasa/homebrew-rmemo"
brew "rmemo"

# softwares
cask "google-japanese-ime"
cask "visual-studio-code"
cask "docker"
cask "slack"
cask "iterm2"
